configuration/src/InformationRegisters/АвтосохраненныеОписания/АвтосохраненныеОписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АвтосохраненныеОписания</name>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначенияРеквизитов</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектОснование</name>
    <type>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.Задача</types>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОбъекта</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.Задача</types>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Documents/Задача/Задача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Задача</name>
  <basedOn>Document.ЗаявкаНаРазработку</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗадачи</name>
    <type>
      <types>CatalogRef.ВидыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПроцесса</name>
    <type>
      <types>EnumRef.ВидыПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРодительскогоПроекта</name>
    <type>
      <types>CatalogRef.ВидыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаГотовностиРеализации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияСтатуса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРазработки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРассмотрения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодтверждения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоТестирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортированаИзRedmine</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексируемоеОписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КомандаРазработчиков</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>КороткийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Назначена</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.НазначенияЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.НаправленияРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачиRedmine</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектОснование</name>
    <comment>Ссылка на другой объект БД, которому подчинен текущий объект</comment>
    <type>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграниченныйПросмотр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаStoryPoint</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <comment>Порядок задачи в общей очереди</comment>
    <type>
      <types>DefinedType.ПорядокВОчереди</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерьезностьОшибки</name>
    <type>
      <types>CatalogRef.СерьезностьОшибок</types>
    </type>
  </attributes>
  <attributes>
    <name>СистемаУчета</name>
    <type>
      <types>CatalogRef.СистемыУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПубликация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>Выполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

configuration/src/CommonModules/АвтосохраненияДанных/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция ПриСозданииНаСервере(Форма) Экспорт
	
	Если Форма.Параметры.Свойство("АвтосохранениеСсылка") Тогда
		ПараметрыЗаполнения = АвтосохраненияДанныхВызовСервера.ОписаниеИзАвтосохранения(Форма.Параметры, Форма.УникальныйИдентификатор);
		АвтосохраненияДанныхКлиентСервер.ЗаполнитьДанныеОбъектаИзАвтосохранения(Форма, ПараметрыЗаполнения);
		Форма.ЗагруженоАвтосохранение = Истина;
	КонецЕсли;
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

// Добавляет в кэш формы параметры необходимые для работы автосохранения
//
// Параметры:
//  Параметры		  - Структура - Кэш формы который создается при открытии.
//  Ссылка            - Ссылка - Ссылка на объект для которого проверяется наличие автосохранений
//  Основание         - Ссылка - Ссылка на объект-основание
//  ЭтоАвтосохранение - Булево - Если объект был загружен из автосохранения принимает значения Истина
//                      и не происходит повторная проверка автосохранений.
//
Процедура ДобавитьПараметрыДляАвтосохранения(Параметры, Знач Ссылка, Знач Основание, Знач ЭтоАвтосохранение) Экспорт
	
	Параметры.Вставить("ОбработчикАвтосохраненияЗапущен", Ложь);
	
	Если НЕ ЭтоАвтосохранение Тогда
		Автосохранения = АвтосохраненияПоОбъекту(Ссылка, Основание);
		
		Если Автосохранения <> Неопределено Тогда
			Параметры.Вставить("Автосохранения", Автосохранения);
		КонецЕсли;
	КонецЕсли;
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Ссылка);
	Параметры.Вставить("АвтосохраняемыеРеквизиты", МенеджерОбъекта.АвтосохраняемыеРеквизиты());
		
КонецПроцедуры

// Возвращает ссылку на несуществующий объект.
//
// Параметры:
//  Объект - Ссылка - Ссылка на объект.
// 
// Возвращаемое значение:
//  Ссылка. Несуществующая ссылка такого же типа, как и переданный объект.
//
Функция ПолучитьСсылкуНовогоОбъекта(Знач Объект) Экспорт
	
	Тип = ТипЗнч(Объект);
	
	Если Тип = Тип("ДокументСсылка.Задача") Тогда
		НоваяСсылка = Документы.Задача.ПолучитьСсылку();
		
	ИначеЕсли Тип = Тип("ДокументСсылка.ЗаявкаНаРазработку") Тогда
		НоваяСсылка = Документы.ЗаявкаНаРазработку.ПолучитьСсылку();
		
	ИначеЕсли Тип = Тип("ДокументСсылка.ВнутреннееЗадание") Тогда
		НоваяСсылка = Документы.ВнутреннееЗадание.ПолучитьСсылку();
		
	ИначеЕсли Тип = Тип("СправочникСсылка.Проекты") Тогда
		НоваяСсылка = Справочники.Проекты.ПолучитьСсылку();
		
	Иначе
		НоваяСсылка = Неопределено;
	КонецЕсли;
	
	Возврат НоваяСсылка;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция АвтосохраненияПоОбъекту(Знач Ссылка, Знач ОбъектОснование)
	
	Результат = Неопределено;
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	АвтосохраненныеОписания.Объект КАК Объект,
	|	АвтосохраненныеОписания.ДатаСоздания КАК ДатаСоздания,
	|	АвтосохраненныеОписания.Наименование КАК Наименование,
	|	АвтосохраненныеОписания.ОписаниеОбъекта КАК ОписаниеОбъекта
	|ИЗ
	|	РегистрСведений.АвтосохраненныеОписания КАК АвтосохраненныеОписания
	|		ЛЕВОЕ СОЕДИНЕНИЕ #ИмяТаблицы КАК Таблица
	|		ПО АвтосохраненныеОписания.Объект = Таблица.Ссылка
	|ГДЕ
	|	&Условие
	|	И АвтосохраненныеОписания.Пользователь = &Пользователь
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСоздания УБЫВ";
	
	ИмяТаблицы = Ссылка.Метаданные().ПолноеИмя();
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Условие = "АвтосохраненныеОписания.Объект = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Иначе
		ОбъектОснование = ?(ЗначениеЗаполнено(ОбъектОснование), ОбъектОснование, Неопределено);
		
		Условие = 
		"АвтосохраненныеОписания.Объект ССЫЛКА #ИмяТаблицы
		|И Таблица.Ссылка ЕСТЬ NULL
		|И АвтосохраненныеОписания.ОбъектОснование = &ОбъектОснование";
			
		Запрос.УстановитьПараметр("ОбъектОснование", ОбъектОснование);
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Условие", Условие);
	
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "#ИмяТаблицы", ИмяТаблицы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Результат = Новый Массив;
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.Наименование) Тогда
				ОбъектПредставление = Выборка.Наименование;
			Иначе
				ОбъектПредставление = "Новый объект";
			КонецЕсли;
			
			Строка = Новый Структура;
			Строка.Вставить("АвтосохранениеСсылка", Выборка.Объект);
			Строка.Вставить("ДатаСохранения", Выборка.ДатаСоздания);
			Строка.Вставить("АвтосохранениеТекстОписания", Выборка.ОписаниеОбъекта.Получить());
			Строка.Вставить("ОбъектПредставление", ОбъектПредставление);
			
			Результат.Добавить(Строка);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
